# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [7]:
import pandas as pd

In [2]:
import sqlite3
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c=conn.cursor()

In [4]:
c.execute("""SELECT firstName,lastName, city, state
            FROM employees
            JOIN offices
            USING (officeCode)
            ORDER BY firstName, lastName DESC
    ;""").fetchall()

[('Andy', 'Fixter', 'Sydney', ''),
 ('Anthony', 'Bow', 'San Francisco', 'CA'),
 ('Barry', 'Jones', 'London', ''),
 ('Diane', 'Murphy', 'San Francisco', 'CA'),
 ('Foon Yue', 'Tseng', 'NYC', 'NY'),
 ('George', 'Vanauf', 'NYC', 'NY'),
 ('Gerard', 'Hernandez', 'Paris', ''),
 ('Gerard', 'Bondur', 'Paris', ''),
 ('Jeff', 'Firrelli', 'San Francisco', 'CA'),
 ('Julie', 'Firrelli', 'Boston', 'MA'),
 ('Larry', 'Bott', 'London', ''),
 ('Leslie', 'Thompson', 'San Francisco', 'CA'),
 ('Leslie', 'Jennings', 'San Francisco', 'CA'),
 ('Loui', 'Bondur', 'Paris', ''),
 ('Mami', 'Nishi', 'Tokyo', 'Chiyoda-Ku'),
 ('Martin', 'Gerard', 'Paris', ''),
 ('Mary', 'Patterson', 'San Francisco', 'CA'),
 ('Pamela', 'Castillo', 'Paris', ''),
 ('Peter', 'Marsh', 'Sydney', ''),
 ('Steve', 'Patterson', 'Boston', 'MA'),
 ('Tom', 'King', 'Sydney', ''),
 ('William', 'Patterson', 'Sydney', ''),
 ('Yoshimi', 'Kato', 'Tokyo', 'Chiyoda-Ku')]

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [9]:
c.execute("""SELECT customerName,orderNumber, orderDate, status
            FROM customers
            JOIN orders
            USING (customerNumber)
    ;""")
df = pd.DataFrame(c.fetchall())
df. columns = [i[0] for i in c.description]
df.head()

         customerName orderNumber   orderDate   status
0   Atelier graphique       10123  2003-05-20  Shipped
1   Atelier graphique       10298  2004-09-27  Shipped
2   Atelier graphique       10345  2004-11-25  Shipped
3  Signal Gift Stores       10124  2003-05-21  Shipped
4  Signal Gift Stores       10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [10]:
c.execute("""SELECT orderNumber, productCode, quantityOrdered,priceEach,orderLineNumber
            FROM orders
            JOIN orderDetails
            USING (orderNumber)
    ;""")
df = pd.DataFrame(c.fetchall())
df. columns = [i[0] for i in c.description]
df.head()

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3
1       10100    S18_2248              50     55.09               2
2       10100    S18_4409              22     75.46               4
3       10100    S24_3969              49     35.29               1
4       10101    S18_2325              25    108.06               4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [4]:
c.execute("""SELECT orderNumber, productCode, quantityOrdered,priceEach,orderLineNumber,

            FROM orders
            JOIN orderDetails
            USING (orderNumber)
    ;""")
df = pd.DataFrame(c.fetchall())
df. columns = [i[0] for i in c.description]
df.head()

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!